team_a/updated-c4.md
```mermaid
   C4Context
   title System context for UEFA EURO 2024 Ticketing
   System(ticketingSystem, "Ticketing System", "Allows customers to view <br/>fixtures and request tickets.")
   System_Ext(paymentGateway, "Payment Gateway system", "Performs different methods <br/>of payments.")
   System_Ext(notificationSystem, "Notification system", "Sends emails and <br/>notifications to customers.")
   Person_Ext(user, "User", "A customer who's<br/>  interested in watching the<br/>  game in the stadium.")
   Person_Ext(admin, "Admin", "UEFA administrator user <br/>who takes care of fixtures, <br/>ticket approvals, lottery draw.")
   Person_Ext(ticketAdmin, "Ticket Admin", "Ticket administrator ")
  
   Rel(user, ticketingSystem, "Uses")
   Rel(admin, ticketingSystem, "Uses")
   Rel(ticketAdmin, ticketingSystem, "Uses")
   Rel(ticketingSystem, paymentGateway, "Sends payment requests")
   Rel(ticketingSystem, notificationSystem, "Sends e-mail using")
   Rel(ticketingSystem, user, "Sends e-mails to")


```
